## Заливка данных

##### Импорт библиотек

In [2]:
import pandas as pd
import numpy as np
import sqlite3

In [3]:
sqlite3.sqlite_version

'3.39.4'

##### Подключение к БД

In [4]:
con = sqlite3.connect('db')

In [5]:
df = pd.read_csv(
    r'C:\PyCharm\Python\SQL_for_data_analysis\2.DB_connect_and_upload\sql-course-main\german_credit_augmented.csv')

In [6]:
df

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id
0,33,male,2,own,NaN,NaN,3074,9,radio/TV,0,2008-06-29 18:52:00,210
1,43,male,1,own,little,little,1344,12,car,0,2007-05-20 18:30:19,929
2,52,male,2,own,quite rich,NaN,936,9,education,0,2008-04-27 08:23:07,200
3,35,female,3,own,little,NaN,1393,11,car,0,2007-05-06 10:58:22,45
4,28,male,2,own,little,NaN,776,12,radio/TV,0,2007-07-21 13:22:14,358
...,...,...,...,...,...,...,...,...,...,...,...,...
995,65,male,2,free,little,little,2600,18,radio/TV,1,2007-12-16 20:17:19,624
996,30,male,3,own,little,moderate,4455,36,business,1,2007-07-12 14:08:58,181
997,33,male,2,own,little,moderate,6403,24,radio/TV,0,2008-04-08 03:24:26,730
998,29,female,2,own,NaN,NaN,5003,21,car,1,2007-11-29 15:51:45,557
999,44,male,2,own,moderate,moderate,1804,12,car,0,2007-08-14 09:05:33,23

In [7]:
df.dtypes

age                  int64
sex                 object
job                  int64
housing             object
saving_accounts     object
checking_account    object
credit_amount        int64
duration             int64
purpose             object
default              int64
contract_dt         object
client_id            int64
dtype: object

##### Форматирование даты из csv

In [8]:
df.contract_dt = pd.to_datetime(df.contract_dt, format='%Y-%m-%d %H:%M:%S')

In [9]:
df.dtypes

age                          int64
sex                         object
job                          int64
housing                     object
saving_accounts             object
checking_account            object
credit_amount                int64
duration                     int64
purpose                     object
default                      int64
contract_dt         datetime64[ns]
client_id                    int64
dtype: object

##### Загрузка данных в БД

In [10]:
df.to_sql('german_credit', con, index=False, if_exists='replace')

1000

## Селект к таблице

In [11]:
def select(sql):
    return pd.read_sql(sql, con)

##### Загрузить всю таблицу
##### !ВАЖНО! указывать ПСЕВДОНИМ таблицы (t) или полное название таблицы, во избежании путаницы в дальнейшем
##### В SQL принято ФОРМАТИРОВАТЬ служебные слова БОЛЬШИМИ БУКВАМИ, по
##### Форматирование часто зависит от команды, при работе одному можно не оформлять форматирование

In [12]:
sql = '''select * from german_credit t'''

In [13]:
select(sql)

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id
0,33,male,2,own,None,None,3074,9,radio/TV,0,2008-06-29 18:52:00,210
1,43,male,1,own,little,little,1344,12,car,0,2007-05-20 18:30:19,929
2,52,male,2,own,quite rich,None,936,9,education,0,2008-04-27 08:23:07,200
3,35,female,3,own,little,None,1393,11,car,0,2007-05-06 10:58:22,45
4,28,male,2,own,little,None,776,12,radio/TV,0,2007-07-21 13:22:14,358
...,...,...,...,...,...,...,...,...,...,...,...,...
995,65,male,2,free,little,little,2600,18,radio/TV,1,2007-12-16 20:17:19,624
996,30,male,3,own,little,moderate,4455,36,business,1,2007-07-12 14:08:58,181
997,33,male,2,own,little,moderate,6403,24,radio/TV,0,2008-04-08 03:24:26,730
998,29,female,2,own,None,None,5003,21,car,1,2007-11-29 15:51:45,557
999,44,male,2,own,moderate,moderate,1804,12,car,0,2007-08-14 09:05:33,23

##### Загрузить 1 колонку (возраст)

In [14]:
sql = '''select t.age from german_credit t'''

In [15]:
select(sql)

     age
0     33
1     43
2     52
3     35
4     28
..   ...
995   65
996   30
997   33
998   29
999   44

[1000 rows x 1 columns]

In [16]:
sql = '''select t.age, t.housing, t.age from german_credit t'''
select(sql)

     age housing  age
0     33     own   33
1     43     own   43
2     52     own   52
3     35     own   35
4     28     own   28
..   ...     ...  ...
995   65    free   65
996   30     own   30
997   33     own   33
998   29     own   29
999   44     own   44

[1000 rows x 3 columns]

In [17]:
sql = '''select t.age * 3 as age_mult3
from german_credit t'''  # Возраст умноженный на 3
select(sql)

     age_mult3
0           99
1          129
2          156
3          105
4           84
..         ...
995        195
996         90
997         99
998         87
999        132

[1000 rows x 1 columns]

## Основные действия в Select

##### Сложение столбцов, умножение, деление и т.д.

In [18]:
sql = '''select t.age + t.credit_amount as summm,
t.age * 3 as age_mult3,
t.age * 1.0 / t.credit_amount as age_div_amount

from german_credit t'''
select(sql)
# t.* выводит все столбцы
# При делении целого числа нужно добавить * 1.0, чтобы избежать ошибки (0)

     summm  age_mult3  age_div_amount
0     3107         99        0.010735
1     1387        129        0.031994
2      988        156        0.055556
3     1428        105        0.025126
4      804         84        0.036082
..     ...        ...             ...
995   2665        195        0.025000
996   4485         90        0.006734
997   6436         99        0.005154
998   5032         87        0.005797
999   1848        132        0.024390

[1000 rows x 3 columns]

##### Для просмотра БД, лучше просмотреть только начало, во избежание зависаний и т.д.
##### Загрузка 5 строк

In [19]:
sql = '''select * from german_credit t limit 5'''
select(sql)

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id
0,33,male,2,own,None,None,3074,9,radio/TV,0,2008-06-29 18:52:00,210
1,43,male,1,own,little,little,1344,12,car,0,2007-05-20 18:30:19,929
2,52,male,2,own,quite rich,None,936,9,education,0,2008-04-27 08:23:07,200
3,35,female,3,own,little,None,1393,11,car,0,2007-05-06 10:58:22,45
4,28,male,2,own,little,None,776,12,radio/TV,0,2007-07-21 13:22:14,358

## Where

##### Выбираю промежуток дат в БД

In [20]:
sql = '''select * from german_credit t
where t.contract_dt between '2007-01-01' and '2007-12-31'
'''
select(sql)

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id
0,43,male,1,own,little,little,1344,12,car,0,2007-05-20 18:30:19,929
1,35,female,3,own,little,None,1393,11,car,0,2007-05-06 10:58:22,45
2,28,male,2,own,little,None,776,12,radio/TV,0,2007-07-21 13:22:14,358
3,29,female,2,own,little,moderate,959,9,furniture/equipment,1,2007-05-21 14:32:00,351
4,26,male,2,own,little,little,4370,42,radio/TV,1,2007-11-29 00:20:44,639
...,...,...,...,...,...,...,...,...,...,...,...,...
568,45,male,1,own,quite rich,None,1750,6,radio/TV,0,2007-05-25 13:59:51,551
569,65,male,2,free,little,little,2600,18,radio/TV,1,2007-12-16 20:17:19,624
570,30,male,3,own,little,moderate,4455,36,business,1,2007-07-12 14:08:58,181
571,29,female,2,own,None,None,5003,21,car,1,2007-11-29 15:51:45,557
572,44,male,2,own,moderate,moderate,1804,12,car,0,2007-08-14 09:05:33,23

##### Показывает количество строк ↑

In [21]:
sql = '''select count(*) from german_credit t
where t.contract_dt between '2007-01-01' and '2007-12-31'
'''
select(sql)

   count(*)
0       573

##### Сортируем тот же ↑ запрос

In [22]:
sql = '''select * from german_credit t
where t.contract_dt between '2007-01-01' and '2007-12-31'
order by contract_dt desc
'''
# desc - по убыванию (descending - нисходящий)
select(sql)

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id
0,31,female,1,own,little,None,1736,12,furniture/equipment,0,2007-12-30 13:29:15,995
1,35,male,1,own,little,None,2684,24,radio/TV,0,2007-12-30 00:40:33,256
2,23,female,2,rent,little,little,2406,30,furniture/equipment,1,2007-12-29 20:14:30,359
3,36,male,3,rent,None,moderate,7057,20,car,0,2007-12-29 16:10:08,99
4,30,male,2,own,little,moderate,639,12,repairs,1,2007-12-28 17:09:43,127
...,...,...,...,...,...,...,...,...,...,...,...,...
568,31,male,2,own,little,None,2775,18,car,1,2007-05-01 23:14:02,598
569,39,female,1,own,None,moderate,932,6,education,0,2007-05-01 20:28:44,215
570,30,female,3,own,little,moderate,4795,36,radio/TV,0,2007-05-01 12:42:45,141
571,49,female,2,own,little,moderate,1092,12,radio/TV,0,2007-05-01 08:41:46,288
572,20,male,2,own,None,little,2996,24,furniture/equipment,1,2007-05-01 07:17:29,495

##### Сортировка по нескольким условиям

In [23]:
sql = '''select * from german_credit t
where t.contract_dt between '2007-01-01' and '2007-12-31'
order by contract_dt desc, credit_amount
'''
# desc - по убыванию (descending - нисходящий)
select(sql)

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id
0,31,female,1,own,little,None,1736,12,furniture/equipment,0,2007-12-30 13:29:15,995
1,35,male,1,own,little,None,2684,24,radio/TV,0,2007-12-30 00:40:33,256
2,23,female,2,rent,little,little,2406,30,furniture/equipment,1,2007-12-29 20:14:30,359
3,36,male,3,rent,None,moderate,7057,20,car,0,2007-12-29 16:10:08,99
4,30,male,2,own,little,moderate,639,12,repairs,1,2007-12-28 17:09:43,127
...,...,...,...,...,...,...,...,...,...,...,...,...
568,31,male,2,own,little,None,2775,18,car,1,2007-05-01 23:14:02,598
569,39,female,1,own,None,moderate,932,6,education,0,2007-05-01 20:28:44,215
570,30,female,3,own,little,moderate,4795,36,radio/TV,0,2007-05-01 12:42:45,141
571,49,female,2,own,little,moderate,1092,12,radio/TV,0,2007-05-01 08:41:46,288
572,20,male,2,own,None,little,2996,24,furniture/equipment,1,2007-05-01 07:17:29,495

##### Выбираем цель кредита - машина

In [24]:
sql = '''select * from german_credit t
where t.contract_dt between '2007-01-01' and '2007-12-31'
and t.purpose = 'car'

order by contract_dt desc, credit_amount
'''
select(sql)

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id
0,36,male,3,rent,None,moderate,7057,20,car,0,2007-12-29 16:10:08,99
1,25,male,2,rent,moderate,moderate,1264,15,car,1,2007-12-28 08:38:58,979
2,48,male,2,own,little,None,2134,9,car,0,2007-12-24 16:28:30,20
3,43,male,2,rent,little,little,4843,12,car,1,2007-12-22 16:17:29,668
4,37,male,2,free,None,moderate,12389,36,car,1,2007-12-21 00:06:27,563
...,...,...,...,...,...,...,...,...,...,...,...,...
177,75,male,3,free,little,little,6615,24,car,0,2007-05-06 09:37:45,330
178,55,male,2,own,rich,None,1413,12,car,0,2007-05-05 06:35:11,209
179,47,male,3,own,little,moderate,1209,6,car,1,2007-05-03 10:29:01,485
180,36,male,2,own,little,moderate,884,18,car,1,2007-05-02 06:22:11,184
181,31,male,2,own,little,None,2775,18,car,1,2007-05-01 23:14:02,598

In [25]:
sql = '''select count(*) from german_credit t
where t.contract_dt between '2007-01-01' and '2007-12-31'
and t.purpose = 'car'

order by contract_dt desc, credit_amount
'''
select(sql)

   count(*)
0       182

##### Несколько целей кредита

In [26]:
sql = '''select * from german_credit t
where t.contract_dt between '2007-01-01' and '2007-12-31'
and t.purpose in ('car', 'repairs')

order by contract_dt desc, credit_amount
'''
select(sql)
# -- комментит строку

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id
0,36,male,3,rent,None,moderate,7057,20,car,0,2007-12-29 16:10:08,99
1,30,male,2,own,little,moderate,639,12,repairs,1,2007-12-28 17:09:43,127
2,25,male,2,rent,moderate,moderate,1264,15,car,1,2007-12-28 08:38:58,979
3,48,male,2,own,little,None,2134,9,car,0,2007-12-24 16:28:30,20
4,67,female,2,own,little,moderate,3872,18,repairs,0,2007-12-24 12:25:28,779
...,...,...,...,...,...,...,...,...,...,...,...,...
192,55,male,2,own,rich,None,1413,12,car,0,2007-05-05 06:35:11,209
193,55,female,0,free,little,little,1190,18,repairs,1,2007-05-05 00:14:17,429
194,47,male,3,own,little,moderate,1209,6,car,1,2007-05-03 10:29:01,485
195,36,male,2,own,little,moderate,884,18,car,1,2007-05-02 06:22:11,184
196,31,male,2,own,little,None,2775,18,car,1,2007-05-01 23:14:02,598

In [27]:
t = pd.DataFrame({'purpose': ['машина', 'на машину', 'на покупку машины', 'автомобиль', 'на возвращение 2007'],
              'amount': [1000, 400, 600, 700, 1500]})

In [28]:
t.to_sql('purpose', con, index=False, if_exists='replace')

5

In [29]:
sql = '''select * from purpose t'''

In [30]:
select(sql)

               purpose  amount
0               машина    1000
1            на машину     400
2    на покупку машины     600
3           автомобиль     700
4  на возвращение 2007    1500

## Like

In [31]:
sql = '''select * from purpose t
where  t.purpose like '%машин%'
or t.purpose like '%автомоб%'
'''

In [32]:
select(sql)

             purpose  amount
0             машина    1000
1          на машину     400
2  на покупку машины     600
3         автомобиль     700

In [33]:
sql = '''select * from purpose t
where  (t.purpose like '%машин%'
or t.purpose like '%автомоб%')
and t.amount > 500
'''
# Скобки обязательны иначе or будет выполняться неверно

In [34]:
select(sql)

             purpose  amount
0             машина    1000
1  на покупку машины     600
2         автомобиль     700

## Case when

##### Посчитать количество кредитов, где сумма кредита превышает 1000

In [35]:
sql = '''select count(*) from german_credit t
where t.credit_amount > 1000
'''
# Количество кредитов,где сумма кредита превышает 1000

In [36]:
select(sql)

   count(*)
0       884

In [50]:
884/1000

0.884

In [48]:
sql = '''select t.credit_amount,
case when t.credit_amount > 1000 then 1 else 0 end as greater_1000_flag

from german_credit t'''

In [49]:
select(sql)

     credit_amount  greater_1000_flag
0             3074                  1
1             1344                  1
2              936                  0
3             1393                  1
4              776                  0
..             ...                ...
995           2600                  1
996           4455                  1
997           6403                  1
998           5003                  1
999           1804                  1

[1000 rows x 2 columns]

##### То же самое, только через iif ↑
##### iif можно использовать в простых случаях

In [43]:
sql = '''select t.credit_amount,
iif(t.credit_amount > 1000, 1, 0) as greater_1000_flag
from german_credit t'''

In [44]:
select(sql)

     credit_amount  greater_1000_flag
0             3074                  1
1             1344                  1
2              936                  0
3             1393                  1
4              776                  0
..             ...                ...
995           2600                  1
996           4455                  1
997           6403                  1
998           5003                  1
999           1804                  1

[1000 rows x 2 columns]

##### Для подсчёта доли можно использовать avg

In [53]:
sql = '''select
avg(case when t.credit_amount > 1000 then 1 else 0 end) as greater_1000_frac

from german_credit t'''

In [54]:
select(sql)

   greater_1000_frac
0              0.884

## Сохранение результата в отдельную таблицу в БД

In [55]:
sql = '''select * from german_credit t
where t.credit_amount > 1000'''

In [56]:
select(sql)

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id
0,33,male,2,own,None,None,3074,9,radio/TV,0,2008-06-29 18:52:00,210
1,43,male,1,own,little,little,1344,12,car,0,2007-05-20 18:30:19,929
2,35,female,3,own,little,None,1393,11,car,0,2007-05-06 10:58:22,45
3,27,female,2,own,little,moderate,1295,18,furniture/equipment,0,2008-06-18 04:10:05,86
4,26,male,2,own,little,little,4370,42,radio/TV,1,2007-11-29 00:20:44,639
...,...,...,...,...,...,...,...,...,...,...,...,...
879,65,male,2,free,little,little,2600,18,radio/TV,1,2007-12-16 20:17:19,624
880,30,male,3,own,little,moderate,4455,36,business,1,2007-07-12 14:08:58,181
881,33,male,2,own,little,moderate,6403,24,radio/TV,0,2008-04-08 03:24:26,730
882,29,female,2,own,None,None,5003,21,car,1,2007-11-29 15:51:45,557
883,44,male,2,own,moderate,moderate,1804,12,car,0,2007-08-14 09:05:33,23

##### Создаём курсор

In [57]:
cur = con.cursor()

##### Создаём запрос на создание таблицы

In [60]:
sql = '''
create table greater_1000_credit as
select * from german_credit t
where t.credit_amount > 1000'''

##### Если таблица существует, то создание такой же выдаст ошибку, по этому нужно удалить таблицу, если она существует

In [65]:
sql = '''
drop table if exists greater_1000_credit;

create table greater_1000_credit as
select * from german_credit t
where t.credit_amount > 1000'''
# ; - обязательны, т.к. выполняются 2 разные команды

##### Выполняем запрос

In [66]:
cur.execute(sql)

ProgrammingError: You can only execute one statement at a time.

##### При выполнении нескольких команд, нужно использовать executescript

In [ ]:
cur.executescript(sql)

##### Выполняем селект из новый таблицы

In [67]:
sql = '''select * from greater_1000_credit t'''

In [68]:
select(sql)

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id
0,33,male,2,own,None,None,3074,9,radio/TV,0,2008-06-29 18:52:00,210
1,43,male,1,own,little,little,1344,12,car,0,2007-05-20 18:30:19,929
2,35,female,3,own,little,None,1393,11,car,0,2007-05-06 10:58:22,45
3,27,female,2,own,little,moderate,1295,18,furniture/equipment,0,2008-06-18 04:10:05,86
4,26,male,2,own,little,little,4370,42,radio/TV,1,2007-11-29 00:20:44,639
...,...,...,...,...,...,...,...,...,...,...,...,...
879,65,male,2,free,little,little,2600,18,radio/TV,1,2007-12-16 20:17:19,624
880,30,male,3,own,little,moderate,4455,36,business,1,2007-07-12 14:08:58,181
881,33,male,2,own,little,moderate,6403,24,radio/TV,0,2008-04-08 03:24:26,730
882,29,female,2,own,None,None,5003,21,car,1,2007-11-29 15:51:45,557
883,44,male,2,own,moderate,moderate,1804,12,car,0,2007-08-14 09:05:33,23

## Создание таблицы в Postgres